reports/mysql-coupon-loadtest/runs/batch-n200-500rps-002/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/coupon-arrival-rate.js
        output: -

     scenarios: (100.00%) 1 scenario, 6000 max VUs, 40s max duration (incl. graceful stop):
              * unique_member_first_request: 500.00 iterations/s for 10s (maxVUs: 3000-6000, gracefulStop: 30s)


running (00.0s), 0000/3000 VUs, 0 complete and 0 interrupted iterations
unique_member_first_request   [   0% ] 0000/0960 VUs  00.0s/10s  500.00 iters/s

running (01.0s), 0418/3000 VUs, 91 complete and 0 interrupted iterations
unique_member_first_request   [  10% ] 0418/3000 VUs  01.0s/10s  500.00 iters/s

running (02.0s), 0556/3000 VUs, 460 complete and 0 interrupted iterations
unique_member_first_request   [  20% ] 0556/3000 VUs  02.0s/10s  500.00 iters/s

running (03.0s), 0765/3000 VUs, 751 complete and 0 interrupted iterations
unique_member_first_request   [  30% ] 0765/3000 VUs  03.0s/10s  500.00 iters/s

running (04.0s), 1093/3000 VUs, 922 complete and 0 interrupted iterations
unique_member_first_request   [  40% ] 1093/3000 VUs  04.0s/10s  500.00 iters/s

running (05.0s), 1322/3000 VUs, 1194 complete and 0 interrupted iterations
unique_member_first_request   [  50% ] 1322/3000 VUs  05.0s/10s  500.00 iters/s

running (06.0s), 1449/3000 VUs, 1566 complete and 0 interrupted iterations
unique_member_first_request   [  60% ] 1449/3000 VUs  06.0s/10s  500.00 iters/s

running (07.0s), 1478/3000 VUs, 2038 complete and 0 interrupted iterations
unique_member_first_request   [  70% ] 1478/3000 VUs  07.0s/10s  500.00 iters/s

running (08.0s), 1773/3000 VUs, 2247 complete and 0 interrupted iterations
unique_member_first_request   [  80% ] 1773/3000 VUs  08.0s/10s  500.00 iters/s

running (09.0s), 1909/3000 VUs, 2606 complete and 0 interrupted iterations
unique_member_first_request   [  90% ] 1909/3000 VUs  09.0s/10s  500.00 iters/s

running (10.0s), 1784/3000 VUs, 3219 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1805/3000 VUs  10s  500.00 iters/s

running (11.0s), 1002/3000 VUs, 4001 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1805/3000 VUs  10s  500.00 iters/s

running (12.0s), 0364/3000 VUs, 4639 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1805/3000 VUs  10s  500.00 iters/s

running (13.0s), 0163/3000 VUs, 4840 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1805/3000 VUs  10s  500.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 5003   366.426812/s
    checks_succeeded...: 99.88% 4997 out of 5003
    checks_failed......: 0.11%  6 out of 5003

    ✗ business response or no server error
      ↳  99% — ✓ 4997 / ✗ 6

    CUSTOM
    coupon_issue_business_response_under_2s...: 20.10% 1006 out of 5003
    coupon_issue_issued.......................: 4997   365.987363/s

    HTTP
    http_req_duration.........................: avg=2.8s  min=0s      med=2.87s max=8.83s p(90)=4.33s p(95)=4.71s p(99)=6.15s
      { expected_response:true }..............: avg=2.81s min=89.02ms med=2.87s max=8.83s p(90)=4.33s p(95)=4.71s p(99)=6.15s
    http_req_failed...........................: 0.11%  6 out of 5003
    http_reqs.................................: 5003   366.426812/s

    EXECUTION
    iteration_duration........................: avg=2.82s min=18.08ms med=2.89s max=8.83s p(90)=4.34s p(95)=4.71s p(99)=6.16s
    iterations................................: 5003   366.426812/s
    vus.......................................: 163    min=0            max=1905
    vus_max...................................: 3000   min=3000         max=3000

    NETWORK
    data_received.............................: 1.2 MB 86 kB/s
    data_sent.................................: 1.6 MB 116 kB/s



running (13.7s), 0000/3000 VUs, 5003 complete and 0 interrupted iterations
unique_member_first_request ✓ [ 100% ] 0000/3000 VUs  10s  500.00 iters/s